# EdgeArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArray Constructor
EdgeArray Class See Also
---
Initializes a new instance of the EdgeArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EdgeArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
EdgeArray()
```

# See Also
EdgeArray Class
Autodesk.Revit.DB Namespace